In [2]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [3]:
df = pd.read_csv('sample.csv')

In [4]:
df

    1   2   3  vicky
0   4   5   6  pande
1   7   8   9   Pune
2  10  11  12  India

In [5]:
df = pd.read_csv('sample.csv',header=None)

In [6]:
df

    0   1   2      3
0   1   2   3  vicky
1   4   5   6  pande
2   7   8   9   Pune
3  10  11  12  India

In [7]:
df_table = pd.read_table('sample.csv',sep=",", header=None )

In [8]:
df_table

    0   1   2      3
0   1   2   3  vicky
1   4   5   6  pande
2   7   8   9   Pune
3  10  11  12  India

In [9]:
pd.read_csv('sample.csv',header=None, nrows=2)

   0  1  2      3
0  1  2  3  vicky
1  4  5  6  pande

In [10]:
df.to_csv('mycsv.csv')

In [11]:
import sys

In [12]:
df.to_csv(sys.stdout)

,0,1,2,3
0,1,2,3,vicky
1,4,5,6,pande
2,7,8,9,Pune
3,10,11,12,India

In [13]:
df.to_csv(sys.stdout, sep="_")

_0_1_2_3
0_1_2_3_vicky
1_4_5_6_pande
2_7_8_9_Pune
3_10_11_12_India

In [14]:
df.to_csv(sys.stdout, columns = [0,1,2])

,0,1,2
0,1,2,3
1,4,5,6
2,7,8,9
3,10,11,12